<!DOCTYPE html>
<html>
    <body>
        <?php
        $products =
        array(
            array("001","ชุดกระโปรงฟรุ้งฟริ้ง","690","DabaseShop/77306789_1258378944346554_7966083067473297408_n.jpg"),
            array("002","ชุดกระโปรงเป็นทางการ","490","DabaseShop/22090036_759771314207322_5866417209795330050_n.jpg"),
            array("003","ชุดกระโปรงไปทะเลสำหรับลูกน้อย","590","DabaseShop/22728797_768413516676435_8061253119069667676_n.jpg"),
            array("004","ชุดเสื้อกันหนาวฮูกน้อย","490","DabaseShop/S__6643729.jpg"),
            array("005","ชุดเสื้อกันหนาวสุนัขจิ้งจอกน้อย","490","DabaseShop/208866913_1722866221231155_2218948419904072816_n.jpg"),
            array("006","ชุดนอนหมีน้อย","290","DabaseShop/178071795_1722866037897840_2587011408226545927_n.jpg"),
            array("007","ชุดนอนมีลาย","290","DabaseShop/26166483_798579203659866_6152736129500748836_n.jpg"),
            array("008","ขุดนอนคู่หู","390","DabaseShop/186018157_1722866177897826_4951117409079078374_n.jpg"),
            array("009","ชุดกระโปรงสีเขียว","690","DabaseShop/21192088_747478055436648_930604311901717996_n.jpg"),
            array("010","ชุดไปเที่ยวสีน้ำตาล","690","DabaseShop/21149890_747478308769956_4705195050514972950_n.jpg"),
        );
        echo '<table width"100%" border="1">
        <tr> 
            <th>id</th>
            <th>name</th>
            <th>price</th>
            <th>img</th>
        </tr>
        ';

        for($i=0;$i<10;$i++){
            $r = rand(0,256);
            $g = rand(0,256);
            $b = rand(0,256);
            echo"<tr>
            <td style ='color:rgb($r,$g,$b)'>".$products[$i][0]."</td>
            <td style ='color:rgb($r,$g,$b)'>".$products[$i][1]."</td>
            <td style ='color:rgb($r,$g,$b)'>".$products[$i][2]."</td>
            <td><img src=".$products[$i][3]." width='230' height='298.5' /></td>
            </tr>";
        }

        echo '</table>';
?>
</body>
</html>